<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<head>
	<meta charset="utf-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="initial-scale=1.0, user-scalable=no" />	
	<title>경로조회 예제</title>

	<script src="/map/jquery-3.4.1.min.js"></script>
	<script src="/map/ol-4.6.5.js"></script>
	<script src="/map/gcenmap.js"></script>
	<link type="text/css" rel="stylesheet" href="/map/ol-4.6.5.css">

	<style>
	    html, body {
	    	height:100%;
	    	overflow:hidden
	    }
		.ol-popup
		{
			position: absolute;
			background-color: white;
			-webkit-filter: drop-shadow(0 1px 4px rgba(0,0,0,0.2));
			filter: drop-shadow(0 1px 4px rgba(0,0,0,0.2));
			/*padding: 15px;*/
			border-radius: 10px;
			border: 1px solid #cccccc;
			bottom: 12px;
			left: -50px;
			min-width: 400px;
		}
		.ol-popup:after, .ol-popup:before
		{
			top: 100%;
			border: solid transparent;
			content: " ";
			height: 0;
			width: 0;
			position: absolute;
			pointer-events: none;
		}
		.ol-popup:after
		{
			border-top-color: white;
			border-width: 10px;
			left: 48px;
			margin-left: -10px;
		}
		.ol-popup:before
		{
			border-top-color: #cccccc;
			border-width: 11px;
			left: 48px;
			margin-left: -11px;
		}
		.ol-popup-title
		{
			padding: 8px 14px;
			margin: 0;
			font-family: 'Malgun Gothic','맑은 고딕',dotum,'돋움',sans-serif ;
			font-size: 14px;
			background-color: #f7f7f7;
			border-bottom: 1px solid #ebebeb;
			border-radius: 5px 5px 0 0;
		}

		.ol-popup-content
		{
			padding: 9px 14px;
		}
		
		.ol-sub-title
		{
			border: 1px solid;
			border-color: #969696;
			font-family: 'Malgun Gothic','맑은 고딕',dotum,'돋움',sans-serif ;
			font-size: 16px;
			color: #323232;
			text-align: center;
			left: 10px;
			width: 150px;
			height : 26px;
			background-color:#f6f6f6;
			vertical-align:middle;
		}
		
		.ol-sub-content
		{
			border: 1px solid;
			border-color: #969696;
			font-family: 'Malgun Gothic','맑은 고딕',dotum,'돋움',sans-serif ;
			font-size: 14px;
			color: #323232;
			left : 10px;
			width : 400px;
			height : 26px;
			background-color: #ffffff;
			padding-left :5px;
			vertical-align: middle;
		}

	</style>
</head>
<body oncontextmenu="return false" onselectstart="return false" ondragstart="return false">

	<div id="map" class="map" style="width:100%; top:100px;height:100%;">
		<div id="popup" class="ol-popup">
			<div class="ol-popup-title">상세정보</div>
			<div class="ol-popup-content"></div>
		</div>
	</div>
	
	<div id="search" class="search" style="padding-left:0px; position:absolute; bottom:0px; left:50%;">
		<input type="button" id="searchRoute" name="searchRoute" onClick="searchRoute()" value="경로조회">
	</div>

	<script>
	    var map;                // 지도 전역 변수
	    var view;               // view 전역 변수
	    var featureSource;
	    var featureLayer;
	    var clickOverlayId = "click-overlay";
	    
	    view = new ol.View({
	        center: ol.proj.fromLonLat([126.898758, 37.484986]), // 페이지 시작시 지도 중심 좌표 설정
	        zoom: 16,       // 페이지 시작시 지도 레벨 설정(필수)
	        minZoom: 5,     // 축소 지도 레벨 설정(필수)
	        maxZoom: 18,     // 확대 지도 레벨 설정(필수),
	        projection: 'EPSG:3857'	// 좌표계
	    });
	
	    // 지도 객체 선언
	    map = gcen.loadMap("map", view, "vt_maplabel");
		var zoomControl = new ol.control.Zoom();
		map.addControl(zoomControl);
	
		var scaleLineControl = new ol.control.ScaleLine();
		map.addControl(scaleLineControl);
		
		var container = $("#popup").get(0);
		var popup = new ol.Overlay({
			id:clickOverlayId,
			element: container,
			positioning: 'bottom-center',
			stopEvent: false,
			offset: [0, -50],
			autoPan: true,
			autoPanAnimation: { duration: 250}
		});
		map.addOverlay(popup);
		
		// feature 소스 생성
		featureSource = new ol.source.Vector();

		// feature 레이어 생성
		featureLayer = new ol.layer.Vector({
			id: "featureLayer",
			source: featureSource
		});

		// 지도에 레이어 추가
		map.addLayer(featureLayer);
		map.on("click", onMarkerClick);
		
		function onMarkerClick(evt)
		{
			var feature;
	        var layer;

	        map.forEachFeatureAtPixel(evt.pixel,
	            function(getFeature,getLayer)
	            {
	                feature = getFeature;
	                layer = getLayer;
	            }
	        );

			var popup = map.getOverlayById(clickOverlayId);
			var obj = popup.getElement();

	        if(layer != undefined && layer.get("id") == "featureLayer" && feature)
	        {
	        	var point;
	        	var title;
				var content;

				if(feature.getGeometry() instanceof ol.geom.Point)
				{
					point = feature.getGeometry().getCoordinates();
					content = feature.get("content");
					$(obj).find(".ol-popup-content").html(content);
				}
				
				if(content == "")
				{
					popup.setPosition(undefined);
				}
				else
				{
					popup.setOffset([0,-50]);
					popup.setPosition(point);	
				}
			}
	        else
	        {
				popup.setPosition(undefined);
			}
		}
	    
	    function drawMap(list, list2, rownum)
	    {
	    	featureSource.clear();
	    	
	    	var sTitle;
	    	var sContent;
	    	var sLat;
	    	var sLon;
	    	var eLat;
	    	var eLon;
	    	var sImg = "/map/img/locate_common.png";

			var lineArray = [];
			var lineArray2 = [];
	    	
			for(var i = 0 ; i < list.length; i++)
			{
				var lat = Number(list[i].LAT);
				var lon = Number(list[i].LON);
				var id = list[i].NO;
				var title = list[i].LOCATE_DT;
				var content = "";
					content += "<table cellspacing='0' cellpadding='0'>";
					content += "<tr>";
					content += "<td class='ol-sub-title'>차량번호</td>";
		        	content += "<td class='ol-sub-content'>" + list[i].CAR_NO + "</td>";
		        	content += "</tr>";
		        	content += "<tr>";
		        	content += "<td class='ol-sub-title'>수신위치</td>";
		        	content += "<td class='ol-sub-content'>" + list[i].LOCATE_ADDR + "</td>";
		        	content += "</tr>";
					content += "<tr>";
		        	content += "<td class='ol-sub-title'>수신일시</td>";
		        	content += "<td class='ol-sub-content'>" + list[i].LOCATE_DT + "</td>";
		        	content += "</tr>";
		        	content += "</table>";	
		    	
		    	if(i == rownum)
		    	{
		    		sImg = "/map/img/locate_common.png";
		    		sLat = lat;
		    		sLon = lon;
		    		sTitle = title;
		    		sContent = content;
		    	}
		    	else
		    	{
		    		var img = "/map/img/route_common.png";
		    		addMarker(lat, lon, title, content, img);
		    	}

				if(i > 0)
		    	{
			    	lineArray.push(ol.proj.transform([eLon, eLat], 'EPSG:4326', 'EPSG:3857'));
			    	lineArray.push(ol.proj.transform([lon, lat], 'EPSG:4326', 'EPSG:3857'));
				}
		    	eLat = lat;
		    	eLon = lon;
			}
			
			for(var i = 0 ; i < list2.length; i++)
			{
				var lat = Number(list2[i].LAT);
				var lon = Number(list2[i].LON);

				if(i > 0)
		    	{
			    	lineArray2.push(ol.proj.transform([eLon, eLat], 'EPSG:4326', 'EPSG:3857'));
			    	lineArray2.push(ol.proj.transform([lon, lat], 'EPSG:4326', 'EPSG:3857'));
				}
		    	eLat = lat;
		    	eLon = lon;
			}
			
			addMarker(sLat, sLon, sTitle, sContent, sImg);
			
		    var polyline = new ol.Feature();
		    polyline.setGeometry(new ol.geom.LineString(lineArray));
		    polyline.setStyle(new ol.style.Style({
				stroke: new ol.style.Stroke({
					color: '#0000FF',
					width: 4
				})
			}));
		    
		    var polyline2 = new ol.Feature();
		    polyline2.setGeometry(new ol.geom.LineString(lineArray2));
		    polyline2.setStyle(new ol.style.Style({
				stroke: new ol.style.Stroke({
					color: '#FF0000',
					width: 4
				})
			}));
		    featureSource.addFeature(polyline);
			featureSource.addFeature(polyline2);
			
			view.setCenter(ol.proj.fromLonLat([sLon, sLat]));
		}
	    
	    function addMarker(lat, lon, title, content, img)
	    {
	    	var marker = new ol.Feature({
				geometry: new ol.geom.Point(ol.proj.fromLonLat([lon, lat])),
				title: title,
				content: content,
                division : "marker",
				rainfall: 500
			});			
	    	
	    	var image = new ol.style.Icon({
	    		anchor: [0.5, 1],
	    		opacity: 1,
	    		src: img
	    	});
	    	
	    	var text = new ol.style.Text({
                text: title,
                stroke: new ol.style.Stroke({ color:"#fff", width:4 }),
                fill: new ol.style.Fill({color:"#333"}),
                font: '13px sans-serif'				
	    	});
	    	
			marker.setStyle(new ol.style.Style({
				image: image,
				text : text
			}));

			featureSource.addFeature(marker);
	    }
	    
	    function searchRoute()
	    {
	    	var list = [{"NO":"1","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:00","LOCATE_ADDR":"서울특별시 영등포구 양평동1가","LON":"126.8904793","LAT":"37.5238158"},{"NO":"2","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:05","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8910815","LAT":"37.5260946"},{"NO":"3","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:10","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920555","LAT":"37.5260163"},{"NO":"4","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:15","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8919785","LAT":"37.5260067"},{"NO":"5","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:20","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.891946","LAT":"37.5260962"},{"NO":"6","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:25","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892047","LAT":"37.5260471"},{"NO":"7","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:30","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892047","LAT":"37.5260471"},{"NO":"8","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:35","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892047","LAT":"37.5260471"},{"NO":"9","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:40","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892047","LAT":"37.5260471"},{"NO":"10","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:45","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892047","LAT":"37.5260471"},{"NO":"11","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:50","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920434","LAT":"37.526056"},{"NO":"12","CAR_NO":"10호차","LOCATE_DT":"04\/21 09:55","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920457","LAT":"37.5260638"},{"NO":"13","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:00","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920457","LAT":"37.5260638"},{"NO":"14","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:05","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920723","LAT":"37.5260564"},{"NO":"15","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:10","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920723","LAT":"37.5260564"},{"NO":"16","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:15","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920723","LAT":"37.5260564"},{"NO":"17","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:20","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920723","LAT":"37.5260564"},{"NO":"18","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:25","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920485","LAT":"37.526057"},{"NO":"19","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:30","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920485","LAT":"37.526057"},{"NO":"20","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:35","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920493","LAT":"37.5260525"},{"NO":"21","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:40","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920512","LAT":"37.5260484"},{"NO":"22","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:45","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892047","LAT":"37.5260458"},{"NO":"23","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:50","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.892035","LAT":"37.526052"},{"NO":"24","CAR_NO":"10호차","LOCATE_DT":"04\/21 10:55","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8920268","LAT":"37.5260584"},{"NO":"25","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:00","LOCATE_ADDR":"서울특별시 영등포구 당산동3가","LON":"126.8921971","LAT":"37.5258639"},{"NO":"26","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:05","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.891068","LAT":"37.5261703"},{"NO":"27","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:10","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8925886","LAT":"37.5293327"},{"NO":"28","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:15","LOCATE_ADDR":"서울특별시 영등포구 양평동3가","LON":"126.8952568","LAT":"37.5325242"},{"NO":"29","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:20","LOCATE_ADDR":"서울특별시 영등포구 양평동4가","LON":"126.8970756","LAT":"37.5348057"},{"NO":"30","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:25","LOCATE_ADDR":"서울특별시 영등포구 양평동4가","LON":"126.8971342","LAT":"37.5349034"},{"NO":"31","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:30","LOCATE_ADDR":"서울특별시 영등포구 당산동6가","LON":"126.9009781","LAT":"37.5370339"},{"NO":"32","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:35","LOCATE_ADDR":"서울특별시 영등포구 양화동","LON":"126.8930126","LAT":"37.5428566"},{"NO":"33","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:40","LOCATE_ADDR":"서울특별시 영등포구 양화동","LON":"126.8830747","LAT":"37.5479744"},{"NO":"34","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:45","LOCATE_ADDR":"서울특별시 영등포구 양화동","LON":"126.8785158","LAT":"37.5531877"},{"NO":"35","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:50","LOCATE_ADDR":"서울특별시 강서구 염창동","LON":"126.8724726","LAT":"37.5566867"},{"NO":"36","CAR_NO":"10호차","LOCATE_DT":"04\/21 11:55","LOCATE_ADDR":"서울특별시 강서구 염창동","LON":"126.862572","LAT":"37.563477"},{"NO":"37","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:00","LOCATE_ADDR":"서울특별시 강서구 가양동","LON":"126.8509644","LAT":"37.5702792"},{"NO":"38","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:05","LOCATE_ADDR":"서울특별시 강서구 가양동","LON":"126.8401367","LAT":"37.5765054"},{"NO":"39","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:10","LOCATE_ADDR":"서울특별시 강서구 마곡동","LON":"126.8269978","LAT":"37.5814125"},{"NO":"40","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:15","LOCATE_ADDR":"서울특별시 강서구 개화동","LON":"126.81371","LAT":"37.5874909"},{"NO":"41","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:20","LOCATE_ADDR":"서울특별시 강서구 개화동","LON":"126.8029795","LAT":"37.593274"},{"NO":"42","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:25","LOCATE_ADDR":"서울특별시 강서구 개화동","LON":"126.796937","LAT":"37.5846239"},{"NO":"43","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:30","LOCATE_ADDR":"서울특별시 강서구 개화동","LON":"126.7983596","LAT":"37.5809373"},{"NO":"44","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:35","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.802941","LAT":"37.5740779"},{"NO":"45","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:40","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8055564","LAT":"37.5654604"},{"NO":"46","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:45","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"47","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:50","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"48","CAR_NO":"10호차","LOCATE_DT":"04\/21 12:55","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"49","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:00","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"50","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:05","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"51","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:10","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"52","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:15","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"53","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:20","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"54","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:25","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"55","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:30","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"56","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:35","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"57","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:40","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"58","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:45","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"59","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:50","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"60","CAR_NO":"10호차","LOCATE_DT":"04\/21 13:55","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"61","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:00","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047565","LAT":"37.5628648"},{"NO":"62","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:05","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"63","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:10","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"64","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:15","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047532","LAT":"37.5628669"},{"NO":"65","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:20","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"66","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:25","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"67","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:30","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047594","LAT":"37.562864"},{"NO":"68","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:35","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047611","LAT":"37.5628699"},{"NO":"69","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:40","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.804759","LAT":"37.5628702"},{"NO":"70","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:45","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"71","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:50","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047456","LAT":"37.5628566"},{"NO":"72","CAR_NO":"10호차","LOCATE_DT":"04\/21 14:55","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"73","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:00","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.804756","LAT":"37.5628649"},{"NO":"74","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:05","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047564","LAT":"37.5628648"},{"NO":"75","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:10","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"76","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:15","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047568","LAT":"37.5628647"},{"NO":"77","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:20","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.804758","LAT":"37.5628633"},{"NO":"78","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:25","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047599","LAT":"37.5628629"},{"NO":"79","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:30","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8026652","LAT":"37.5678535"},{"NO":"80","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:35","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8047268","LAT":"37.5637189"},{"NO":"81","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:40","LOCATE_ADDR":"서울특별시 강서구 방화동","LON":"126.8035643","LAT":"37.5626602"},{"NO":"82","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:45","LOCATE_ADDR":"서울특별시 강서구 공항동","LON":"126.8073451","LAT":"37.5607896"},{"NO":"83","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:50","LOCATE_ADDR":"서울특별시 강서구 공항동","LON":"126.8134552","LAT":"37.5541713"},{"NO":"84","CAR_NO":"10호차","LOCATE_DT":"04\/21 15:55","LOCATE_ADDR":"서울특별시 강서구 외발산동","LON":"126.820493","LAT":"37.5477262"},{"NO":"85","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:00","LOCATE_ADDR":"서울특별시 강서구 외발산동","LON":"126.8217075","LAT":"37.5449937"},{"NO":"86","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:05","LOCATE_ADDR":"서울특별시 강서구 외발산동","LON":"126.8241544","LAT":"37.5416118"},{"NO":"87","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:10","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8251572","LAT":"37.540472"},{"NO":"88","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:15","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8266995","LAT":"37.5381799"},{"NO":"89","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:20","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8305586","LAT":"37.5324951"},{"NO":"90","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:25","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8307794","LAT":"37.5321364"},{"NO":"91","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:30","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8328273","LAT":"37.529058"},{"NO":"92","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:35","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.835815","LAT":"37.5239451"},{"NO":"93","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:40","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8367755","LAT":"37.522428"},{"NO":"94","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:45","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8373327","LAT":"37.5215582"},{"NO":"95","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:50","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8377781","LAT":"37.5207383"},{"NO":"96","CAR_NO":"10호차","LOCATE_DT":"04\/21 16:55","LOCATE_ADDR":"서울특별시 양천구 신월동","LON":"126.8403891","LAT":"37.5147692"},{"NO":"97","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:00","LOCATE_ADDR":"서울특별시 양천구 신정동","LON":"126.843895","LAT":"37.5069695"},{"NO":"98","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:05","LOCATE_ADDR":"서울특별시 구로구 개봉동","LON":"126.8457596","LAT":"37.5031758"},{"NO":"99","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:10","LOCATE_ADDR":"서울특별시 구로구 개봉동","LON":"126.8460419","LAT":"37.50256"},{"NO":"100","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:15","LOCATE_ADDR":"서울특별시 구로구 개봉동","LON":"126.8481633","LAT":"37.498537"},{"NO":"101","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:20","LOCATE_ADDR":"서울특별시 구로구 개봉동","LON":"126.8559791","LAT":"37.4938005"},{"NO":"102","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:25","LOCATE_ADDR":"서울특별시 구로구 개봉동","LON":"126.8666122","LAT":"37.4926809"},{"NO":"103","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:30","LOCATE_ADDR":"서울특별시 구로구 구로동","LON":"126.8757758","LAT":"37.4894225"},{"NO":"104","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:35","LOCATE_ADDR":"서울특별시 구로구 구로동","LON":"126.8770617","LAT":"37.4874713"},{"NO":"105","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:40","LOCATE_ADDR":"서울특별시 구로구 구로동","LON":"126.8768474","LAT":"37.4867525"},{"NO":"106","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:45","LOCATE_ADDR":"서울특별시 구로구 구로동","LON":"126.8767826","LAT":"37.4866437"},{"NO":"107","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:50","LOCATE_ADDR":"서울특별시 구로구 구로동","LON":"126.8764685","LAT":"37.4858266"},{"NO":"108","CAR_NO":"10호차","LOCATE_DT":"04\/21 17:55","LOCATE_ADDR":"서울특별시 금천구 가산동","LON":"126.8745654","LAT":"37.4852344"},{"NO":"109","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:00","LOCATE_ADDR":"서울특별시 금천구 가산동","LON":"126.8745688","LAT":"37.4852346"},{"NO":"110","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:05","LOCATE_ADDR":"서울특별시 금천구 가산동","LON":"126.8737028","LAT":"37.4851455"},{"NO":"111","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:10","LOCATE_ADDR":"서울특별시 금천구 가산동","LON":"126.877301","LAT":"37.4769961"},{"NO":"112","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:15","LOCATE_ADDR":"서울특별시 금천구 가산동","LON":"126.8825211","LAT":"37.4698339"},{"NO":"113","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:20","LOCATE_ADDR":"서울특별시 금천구 독산동","LON":"126.8872459","LAT":"37.464284"},{"NO":"114","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:25","LOCATE_ADDR":"서울특별시 금천구 독산동","LON":"126.8912299","LAT":"37.4554372"},{"NO":"115","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:30","LOCATE_ADDR":"경기도 광명시 소하동","LON":"126.8963049","LAT":"37.4450949"},{"NO":"116","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:35","LOCATE_ADDR":"경기도 광명시 소하동","LON":"126.8904178","LAT":"37.4318185"},{"NO":"117","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:40","LOCATE_ADDR":"경기도 광명시 소하동","LON":"126.8926959","LAT":"37.4343867"},{"NO":"118","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:45","LOCATE_ADDR":"경기도 광명시 가학동","LON":"126.8647205","LAT":"37.4147962"},{"NO":"119","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:50","LOCATE_ADDR":"경기도 광명시 가학동","LON":"126.8577701","LAT":"37.4143699"},{"NO":"120","CAR_NO":"10호차","LOCATE_DT":"04\/21 18:55","LOCATE_ADDR":"경기도 광명시 가학동","LON":"126.8601037","LAT":"37.4043323"},{"NO":"121","CAR_NO":"10호차","LOCATE_DT":"04\/21 19:00","LOCATE_ADDR":"경기도 시흥시 목감동","LON":"126.8642982","LAT":"37.3933702"}];
			var list2 = [{"TG_COST":"0원","LON":"126.8904793","TOTAL_DISTANCE":"약 17.0km","LAT":"37.5238158"},{"LON":"126.89038301972496","LAT":"37.523831357726586"},{"LON":"126.89033272119056","LAT":"37.52362749593812"},{"LON":"126.89031129945286","LAT":"37.52354620145275"},{"LON":"126.89016241620621","LAT":"37.52290506711472"},{"LON":"126.89011957352","LAT":"37.52274247807083"},{"LON":"126.8900023576872","LAT":"37.52225481714796"},{"LON":"126.88987423268118","LAT":"37.52174002246159"},{"LON":"126.88984310275688","LAT":"37.52155051231505"},{"LON":"126.88972642441045","LAT":"37.521026814661994"},{"LON":"126.8895545283362","LAT":"37.520412494095645"},{"LON":"126.88941563258555","LAT":"37.5198615560836"},{"LON":"126.88927794071179","LAT":"37.5192295359394"},{"LON":"126.88922485960292","LAT":"37.51899476731567"},{"LON":"126.88913958322348","LAT":"37.518642561136055"},{"LON":"126.88897887390058","LAT":"37.518037355140244"},{"LON":"126.88892512656575","LAT":"37.517847631897666"},{"LON":"126.88880725741447","LAT":"37.5174050151723"},{"LON":"126.88875377813139","LAT":"37.51719727363137"},{"LON":"126.8885459628151","LAT":"37.51671776883255"},{"LON":"126.88819566143175","LAT":"37.51593057001845"},{"LON":"126.88778948536445","LAT":"37.51509779213025"},{"LON":"126.88734008469528","LAT":"37.51412945008535"},{"LON":"126.88724907023334","LAT":"37.51416463411473"},{"LON":"126.8871472808712","LAT":"37.51416367508088"},{"LON":"126.88707942129915","LAT":"37.514163035676255"},{"LON":"126.88698880807456","LAT":"37.51417119218261"},{"LON":"126.88538271924698","LAT":"37.51492192731264"},{"LON":"126.88467760876999","LAT":"37.515176571507105"},{"LON":"126.88449584300379","LAT":"37.515228917102505"},{"LON":"126.88359617316453","LAT":"37.51563489322524"},{"LON":"126.88312963792521","LAT":"37.51581970003485"},{"LON":"126.88276596664556","LAT":"37.515933395170634"},{"LON":"126.88245938266904","LAT":"37.51601158790943"},{"LON":"126.88184634727709","LAT":"37.51615896187761"},{"LON":"126.88183584363237","LAT":"37.51610480027474"},{"LON":"126.88181376094943","LAT":"37.51606854976719"},{"LON":"126.88179221601598","LAT":"37.515996262904935"},{"LON":"126.88154917377221","LAT":"37.51560651610167"},{"LON":"126.88129482395271","LAT":"37.515216661687056"},{"LON":"126.88118400982233","LAT":"37.51506243588061"},{"LON":"126.88099510219905","LAT":"37.514835387218305"},{"LON":"126.88046150834525","LAT":"37.51420861561341"},{"LON":"126.88014967722185","LAT":"37.51388128638193"},{"LON":"126.88001597844053","LAT":"37.513744863218214"},{"LON":"126.87987123962908","LAT":"37.51359031447799"},{"LON":"126.87961528904475","LAT":"37.51330856559215"},{"LON":"126.87944847119778","LAT":"37.51311776544133"},{"LON":"126.87901466789171","LAT":"37.51262708943278"},{"LON":"126.87854761547169","LAT":"37.512091044320734"},{"LON":"126.8777802042066","LAT":"37.5112187604768"},{"LON":"126.87702398501017","LAT":"37.510355588414654"},{"LON":"126.87632338360929","LAT":"37.50955601319244"},{"LON":"126.87611202113389","LAT":"37.50931973271301"},{"LON":"126.87583442664088","LAT":"37.50897469711587"},{"LON":"126.8756122988138","LAT":"37.5087022718158"},{"LON":"126.8754463122054","LAT":"37.50845741171709"},{"LON":"126.87513601374268","LAT":"37.508030969798995"},{"LON":"126.8750257635043","LAT":"37.50784070208862"},{"LON":"126.87485991589352","LAT":"37.50758683211315"},{"LON":"126.87456323248685","LAT":"37.50700734211345"},{"LON":"126.87440964391214","LAT":"37.50669051572073"},{"LON":"126.87427867401435","LAT":"37.50637390468942"},{"LON":"126.87422429520771","LAT":"37.50622922052147"},{"LON":"126.87412617032022","LAT":"37.50598500529882"},{"LON":"126.87403908403347","LAT":"37.505758915953336"},{"LON":"126.87398511206707","LAT":"37.50558720443627"},{"LON":"126.87359465295206","LAT":"37.50447520606483"},{"LON":"126.87330137593746","LAT":"37.50367048593842"},{"LON":"126.87307338113001","LAT":"37.50303758493645"},{"LON":"126.87300851128765","LAT":"37.50283873783558"},{"LON":"126.87298670751277","LAT":"37.50278446756821"},{"LON":"126.8729324690731","LAT":"37.502630773720576"},{"LON":"126.87287890803478","LAT":"37.502432034442855"},{"LON":"126.87285710446506","LAT":"37.50237776415133"},{"LON":"126.8728354363678","LAT":"37.50231448477476"},{"LON":"126.87272723186442","LAT":"37.50198907874993"},{"LON":"126.8726405605439","LAT":"37.50173596112201"},{"LON":"126.87259749602931","LAT":"37.50159138412094"},{"LON":"126.87249978859174","LAT":"37.50132014029769"},{"LON":"126.87228379256908","LAT":"37.50064230027169"},{"LON":"126.87215406124618","LAT":"37.50024460514227"},{"LON":"126.87196969016551","LAT":"37.499720242815044"},{"LON":"126.87182878990477","LAT":"37.49931343025572"},{"LON":"126.87181788892319","LAT":"37.49928629501294"},{"LON":"126.87174226005313","LAT":"37.49905130287233"},{"LON":"126.87156893094838","LAT":"37.49854506607633"},{"LON":"126.87153609304524","LAT":"37.49847266935559"},{"LON":"126.871481860489","LAT":"37.49831897483022"},{"LON":"126.87143866442395","LAT":"37.498183406475476"},{"LON":"126.87135240834313","LAT":"37.4979032606338"},{"LON":"126.87130921273354","LAT":"37.49776769222999"},{"LON":"126.87123467176048","LAT":"37.497460627087065"},{"LON":"126.87119242590195","LAT":"37.49726199505216"},{"LON":"126.87118274596955","LAT":"37.49715377799587"},{"LON":"126.87116257247743","LAT":"37.49699139838091"},{"LON":"126.87114321277274","LAT":"37.49677496425393"},{"LON":"126.87112398878304","LAT":"37.49654952103317"},{"LON":"126.87112602306404","LAT":"37.496414384762616"},{"LON":"126.87112873541754","LAT":"37.49623420306357"},{"LON":"126.87113049843434","LAT":"37.49611708495612"},{"LON":"126.87113144774689","LAT":"37.49605402135881"},{"LON":"126.87114438225208","LAT":"37.495946020385716"},{"LON":"126.87114600961311","LAT":"37.495837911357654"},{"LON":"126.87115785916234","LAT":"37.49580198306535"},{"LON":"126.87117120040458","LAT":"37.49566695482522"},{"LON":"126.87120851174572","LAT":"37.49544205180692"},{"LON":"126.8712700640049","LAT":"37.495109255797345"},{"LON":"126.87135612772201","LAT":"37.49465054855455"},{"LON":"126.87141672957581","LAT":"37.494380816024936"},{"LON":"126.87152676065723","LAT":"37.49383223371487"},{"LON":"126.87161038132423","LAT":"37.49353568977318"},{"LON":"126.8717058501468","LAT":"37.49320321737293"},{"LON":"126.87178933382214","LAT":"37.49291568234253"},{"LON":"126.8718491194828","LAT":"37.49270000402097"},{"LON":"126.87188561404449","LAT":"37.4925291551788"},{"LON":"126.87191012432716","LAT":"37.49240324381569"},{"LON":"126.87195982211581","LAT":"37.49210637559229"},{"LON":"126.87199699356098","LAT":"37.491890481218"},{"LON":"126.8720597583522","LAT":"37.49147660263825"},{"LON":"126.87213477707573","LAT":"37.49099976825763"},{"LON":"126.872185827534","LAT":"37.490612808870985"},{"LON":"126.87227391154464","LAT":"37.49001896396928"},{"LON":"126.87238528348746","LAT":"37.4893802892596"},{"LON":"126.87248467026997","LAT":"37.488786551944216"},{"LON":"126.87255805828762","LAT":"37.48841782621088"},{"LON":"126.8726070734734","LAT":"37.488166002942776"},{"LON":"126.87263144553837","LAT":"37.48804910039746"},{"LON":"126.87265514055677","LAT":"37.487977243356355"},{"LON":"126.87271654405522","LAT":"37.48765345507633"},{"LON":"126.87274078038219","LAT":"37.487545561596356"},{"LON":"126.87282438862418","LAT":"37.48724901629108"},{"LON":"126.87284835391877","LAT":"37.487159140985824"},{"LON":"126.87287231915329","LAT":"37.487069265673405"},{"LON":"126.87287272524159","LAT":"37.48704223835958"},{"LON":"126.87288470783133","LAT":"37.486997300700374"},{"LON":"126.87290880832347","LAT":"37.48689841627165"},{"LON":"126.87305219183541","LAT":"37.486386191496265"},{"LON":"126.87320633764514","LAT":"37.48591011073135"},{"LON":"126.87327768934594","LAT":"37.485676520890074"},{"LON":"126.87337219285381","LAT":"37.48540711018324"},{"LON":"126.87352660501963","LAT":"37.484913010637165"},{"LON":"126.87369177945854","LAT":"37.48445505504055"},{"LON":"126.87383352976221","LAT":"37.48405093828992"},{"LON":"126.87392775864743","LAT":"37.483799545225125"},{"LON":"126.87402239250402","LAT":"37.4835211247236"},{"LON":"126.8741751739664","LAT":"37.483135133415956"},{"LON":"126.87424530320448","LAT":"37.48298262482568"},{"LON":"126.87446875121069","LAT":"37.48240808793992"},{"LON":"126.87460927703519","LAT":"37.48208505204682"},{"LON":"126.87486663429654","LAT":"37.48151083728414"},{"LON":"126.87533409203644","LAT":"37.480497112112616"},{"LON":"126.87582509095247","LAT":"37.47942053596637"},{"LON":"126.87601149818462","LAT":"37.47905288266929"},{"LON":"126.8762327615937","LAT":"37.47862248770452"},{"LON":"126.87632576105177","LAT":"37.47845217441357"},{"LON":"126.87649991468996","LAT":"37.47814747659964"},{"LON":"126.8765346373414","LAT":"37.478093744305205"},{"LON":"126.87665051401291","LAT":"37.47790562744371"},{"LON":"126.87677809903333","LAT":"37.477690590529065"},{"LON":"126.87696328370095","LAT":"37.477404017665684"},{"LON":"126.8770673146345","LAT":"37.477251829419"},{"LON":"126.87753040281831","LAT":"37.476526386237545"},{"LON":"126.87783131770094","LAT":"37.47606070300999"},{"LON":"126.87837540424813","LAT":"37.475209879691"},{"LON":"126.87860727320236","LAT":"37.4748246326111"},{"LON":"126.87887345520528","LAT":"37.47441267937027"},{"LON":"126.87922064466642","LAT":"37.473875348040956"},{"LON":"126.87949798910024","LAT":"37.47347250958805"},{"LON":"126.87977479265352","LAT":"37.47310570699833"},{"LON":"126.88013206328732","LAT":"37.472649562179065"},{"LON":"126.8804433089389","LAT":"37.472247042670084"},{"LON":"126.8807081279836","LAT":"37.47192517632505"},{"LON":"126.880915084067","LAT":"37.47169286558819"},{"LON":"126.88124892836029","LAT":"37.47129055787238"},{"LON":"126.88153715277457","LAT":"37.47091484861883"},{"LON":"126.8817672470325","LAT":"37.47064671362548"},{"LON":"126.88192817783211","LAT":"37.470468027998585"},{"LON":"126.88204322377416","LAT":"37.47033396014959"},{"LON":"126.88214656351643","LAT":"37.470226812720114"},{"LON":"126.8822844835284","LAT":"37.47007494017006"},{"LON":"126.88257202742955","LAT":"37.46974427396047"},{"LON":"126.8826985083898","LAT":"37.469601303153055"},{"LON":"126.8829746114151","LAT":"37.469279538159164"},{"LON":"126.88314710757328","LAT":"37.46908293926409"},{"LON":"126.88330829973152","LAT":"37.468886233274176"},{"LON":"126.88358453145753","LAT":"37.46855545756591"},{"LON":"126.88390650848392","LAT":"37.46818907154715"},{"LON":"126.884148156571","LAT":"37.46790301994817"},{"LON":"126.88434365395089","LAT":"37.46767960512785"},{"LON":"126.88459673543493","LAT":"37.4673846500822"},{"LON":"126.88491897006197","LAT":"37.46700024272729"},{"LON":"126.88512603312624","LAT":"37.466758914819756"},{"LON":"126.88526420819954","LAT":"37.46658902015485"},{"LON":"126.88574748169819","LAT":"37.46601691037928"},{"LON":"126.8861847354792","LAT":"37.46549842737917"},{"LON":"126.88632290579517","LAT":"37.46532853136427"},{"LON":"126.88671414000842","LAT":"37.464863675196185"},{"LON":"126.88723183251982","LAT":"37.4642558415458"},{"LON":"126.88773808079759","LAT":"37.4636569082311"},{"LON":"126.88804884738171","LAT":"37.46328139438526"},{"LON":"126.88856691808087","LAT":"37.46264652680515"},{"LON":"126.88902700322771","LAT":"37.462110226584855"},{"LON":"126.88908471334862","LAT":"37.462029675131085"},{"LON":"126.88939519983192","LAT":"37.461672175813504"},{"LON":"126.88999369319833","LAT":"37.46094795300075"},{"LON":"126.89022385936862","LAT":"37.460670790915636"},{"LON":"126.890523166008","LAT":"37.46030417303467"},{"LON":"126.89092671386472","LAT":"37.45976733418587"},{"LON":"126.89113453557131","LAT":"37.45947193960818"},{"LON":"126.89134248863353","LAT":"37.45916753541986"},{"LON":"126.89145816514808","LAT":"37.45898841157772"},{"LON":"126.8917356535379","LAT":"37.45856752304291"},{"LON":"126.89204823958484","LAT":"37.45806586879191"},{"LON":"126.89218757883215","LAT":"37.45781488239666"},{"LON":"126.892477555864","LAT":"37.45731301495501"},{"LON":"126.89280355806494","LAT":"37.456667316959745"},{"LON":"126.89409461685047","LAT":"37.45419251927868"},{"LON":"126.89442045842216","LAT":"37.45355582526757"},{"LON":"126.8946536345852","LAT":"37.45307144145026"},{"LON":"126.8950390179503","LAT":"37.45222806174655"},{"LON":"126.89554150403507","LAT":"37.451106450586394"},{"LON":"126.89664013924528","LAT":"37.448638833628095"},{"LON":"126.89697921835482","LAT":"37.44786709816179"},{"LON":"126.89783240255909","LAT":"37.44594681625028"},{"LON":"126.89845202498238","LAT":"37.44453794798062"},{"LON":"126.89905953225629","LAT":"37.44318302601919"},{"LON":"126.89929330474922","LAT":"37.44265358494716"},{"LON":"126.89950421171395","LAT":"37.44214195140661"},{"LON":"126.89972786591429","LAT":"37.44153132076343"},{"LON":"126.89985914626278","LAT":"37.441054987101055"},{"LON":"126.89993155634181","LAT":"37.4407402940758"},{"LON":"126.89999266691083","LAT":"37.440425495821565"},{"LON":"126.90004287374036","LAT":"37.440083564578124"},{"LON":"126.90007035066506","LAT":"37.439750432249596"},{"LON":"126.90008705606019","LAT":"37.43938115770041"},{"LON":"126.90008116392698","LAT":"37.439011672831406"},{"LON":"126.90006318199985","LAT":"37.43869613836639"},{"LON":"126.90005438888186","LAT":"37.43852485723386"},{"LON":"126.89999226796593","LAT":"37.43813682803386"},{"LON":"126.89991924481333","LAT":"37.43772166583742"},{"LON":"126.89983400079153","LAT":"37.437369463259095"},{"LON":"126.89971552195911","LAT":"37.43697189876521"},{"LON":"126.89958521838145","LAT":"37.436610266013986"},{"LON":"126.89945425637438","LAT":"37.43629367943767"},{"LON":"126.89930083098633","LAT":"37.435967873026215"},{"LON":"126.89914727493567","LAT":"37.43565107568316"},{"LON":"126.89898229006795","LAT":"37.435343182165745"},{"LON":"126.89864076226301","LAT":"37.434745307711076"},{"LON":"126.89822200327527","LAT":"37.43402056543729"},{"LON":"126.89772575314578","LAT":"37.43318697307408"},{"LON":"126.89721834837508","LAT":"37.43234426401922"},{"LON":"126.89688801309943","LAT":"37.431755499308146"},{"LON":"126.89666827728297","LAT":"37.43132995503653"},{"LON":"126.89647140327955","LAT":"37.43088660278703"},{"LON":"126.8962858288981","LAT":"37.43044335570381"},{"LON":"126.8961345454062","LAT":"37.429973397053764"},{"LON":"126.89600546123685","LAT":"37.429530677025376"},{"LON":"126.89591013766237","LAT":"37.42909728268296"},{"LON":"126.89584645686399","LAT":"37.42881736233555"},{"LON":"126.89561300856009","LAT":"37.42778798429919"},{"LON":"126.89547660488995","LAT":"37.42707488011165"},{"LON":"126.89520181899621","LAT":"37.42578381014443"},{"LON":"126.89502182509166","LAT":"37.42496217176767"},{"LON":"126.8949581507281","LAT":"37.424682250857146"},{"LON":"126.8947252557868","LAT":"37.42361683367842"},{"LON":"126.89450313341538","LAT":"37.422587558678536"},{"LON":"126.89430162166784","LAT":"37.421693633562924"},{"LON":"126.89414238323548","LAT":"37.420998334713666"},{"LON":"126.8939605559419","LAT":"37.420302824243734"},{"LON":"126.89380930586778","LAT":"37.41983286238061"},{"LON":"126.89366802788287","LAT":"37.41945309875494"},{"LON":"126.89363520115994","LAT":"37.41938070743194"},{"LON":"126.89342800704243","LAT":"37.418874179391324"},{"LON":"126.89313190999833","LAT":"37.41826770293084"},{"LON":"126.89280206399182","LAT":"37.41765189910109"},{"LON":"126.89222916685354","LAT":"37.41666438588562"},{"LON":"126.89167860922234","LAT":"37.41569510030715"},{"LON":"126.89145828384413","LAT":"37.41531459279527"},{"LON":"126.89085220107123","LAT":"37.41428170898781"},{"LON":"126.89061022434107","LAT":"37.41383792309631"},{"LON":"126.88987208558122","LAT":"37.41256952136925"},{"LON":"126.88912334207282","LAT":"37.411255962682795"},{"LON":"126.88844065915097","LAT":"37.410060157066155"},{"LON":"126.88819817712584","LAT":"37.40965240345641"},{"LON":"126.88805468165332","LAT":"37.409425790845134"},{"LON":"126.8877893490935","LAT":"37.40903584251059"},{"LON":"126.88746768223285","LAT":"37.408636352944775"},{"LON":"126.88712289769616","LAT":"37.408272686989456"},{"LON":"126.88679977118376","LAT":"37.407972297628845"},{"LON":"126.88640928391126","LAT":"37.40764424135571"},{"LON":"126.8860179996426","LAT":"37.40737023943519"},{"LON":"126.88557024918344","LAT":"37.40709570398089"},{"LON":"126.88497621713657","LAT":"37.406783745229056"},{"LON":"126.88402266220697","LAT":"37.40634224311219"},{"LON":"126.88263161099775","LAT":"37.40569836789061"},{"LON":"126.88174504160968","LAT":"37.40531154370081"},{"LON":"126.8782328705774","LAT":"37.403755493892035"},{"LON":"126.87623558470843","LAT":"37.40287151675042"},{"LON":"126.87592166479804","LAT":"37.40271535371268"},{"LON":"126.8752380369308","LAT":"37.4023574418285"},{"LON":"126.87498045175023","LAT":"37.402210822735604"},{"LON":"126.87438771592028","LAT":"37.401817728700436"},{"LON":"126.8740419475513","LAT":"37.40152609964023"},{"LON":"126.87369645155025","LAT":"37.40121645112045"},{"LON":"126.87339626460043","LAT":"37.40089822281091"},{"LON":"126.87317405042232","LAT":"37.40065282107245"},{"LON":"126.87293046656588","LAT":"37.400326120494604"},{"LON":"126.87287508235585","LAT":"37.40025350833886"},{"LON":"126.87275369630494","LAT":"37.400063130099475"},{"LON":"126.8726434685699","LAT":"37.399881868651946"},{"LON":"126.87240218431664","LAT":"37.39940200997778"},{"LON":"126.87208037005367","LAT":"37.39902049838251"},{"LON":"126.8718605965701","LAT":"37.39861292798616"},{"LON":"126.87174070137402","LAT":"37.39832344712842"},{"LON":"126.87162107723113","LAT":"37.39801594767533"},{"LON":"126.87138183179052","LAT":"37.39740094840675"},{"LON":"126.87131623977396","LAT":"37.397256153854656"},{"LON":"126.87125037776744","LAT":"37.39712937774215"},{"LON":"126.8711730886122","LAT":"37.397011503024466"},{"LON":"126.8710728098356","LAT":"37.39692044033866"},{"LON":"126.87097226100109","LAT":"37.39684739604488"},{"LON":"126.87086014983203","LAT":"37.3967922623055"},{"LON":"126.87074790365253","LAT":"37.396746137698685"},{"LON":"126.87063552242304","LAT":"37.3967090222236"},{"LON":"126.87052300610372","LAT":"37.39668091587936"},{"LON":"126.87036559157934","LAT":"37.3966343594311"},{"LON":"126.870095390778","LAT":"37.39657771450001"},{"LON":"126.86986995320468","LAT":"37.3965485283923"},{"LON":"126.86968968446092","LAT":"37.39651977365833"},{"LON":"126.8694642472379","LAT":"37.39649058678213"},{"LON":"126.86943050610353","LAT":"37.39648125363571"},{"LON":"126.86910411662808","LAT":"37.39640604811709"},{"LON":"126.86852848835834","LAT":"37.39638252006537"},{"LON":"126.86762511767411","LAT":"37.396373871926336"},{"LON":"126.86724077846712","LAT":"37.39639722205699"},{"LON":"126.86721124118944","LAT":"37.39610860226165"},{"LON":"126.86720293223965","LAT":"37.395910291088306"},{"LON":"126.86715212999819","LAT":"37.39478348851303"},{"LON":"126.8671451772291","LAT":"37.39449508500807"},{"LON":"126.86710037965663","LAT":"37.39371975033903"},{"LON":"126.86708963032319","LAT":"37.393683605230144"},{"LON":"126.86704446342172","LAT":"37.39368317246394"},{"LON":"126.8665488485435","LAT":"37.393597327842"},{"LON":"126.86617676496397","LAT":"37.39355771839875"},{"LON":"126.86617676496397","LAT":"37.39355771839875"},{"LON":"126.86606384793659","LAT":"37.39355663558234"},{"LON":"126.86566673762091","LAT":"37.39367897403538"},{"LON":"126.86538349403443","LAT":"37.39373933013979"},{"LON":"126.86513480438414","LAT":"37.393754964572814"},{"LON":"126.8647959166807","LAT":"37.39376072202369"},{"LON":"126.86473932216012","LAT":"37.39376918918976"},{"LON":"126.8646937475847","LAT":"37.39379578319215"},{"LON":"126.8642982","LAT":"37.3933702"}];
	    	drawMap(list, list2, 0);
	    }
	</script>
</body>
</html>